# 在pycharm打印 “Hello world”

print("hello,world")

'''
Python是一种解释型、面向对象、动态数据类型的高级程序设计语言。
Python 是由 Guido van Rossum 在八十年代末和九十年代初，在荷兰国家数学和计算机科学研究所设计出来的。
Python 本身也是由诸多其他语言发展而来的,这包括 ABC、Modula-3、C、C++、Algol-68、SmallTalk、Unix shell 和其他的脚本语言等等。
现在 Python 是由一个核心开发团队在维护，Guido van Rossum 仍然占据着至关重要的作用，指导其进展。

 Python优缺点：
        优点：
        1.易于学习：Python有相对较少的关键字，结构简单，和一个明确定义的语法，学习起来更加简单。
        2.易于阅读：Python代码定义的更清晰。
        3.易于维护：Python的成功在于它的源代码是相当容易维护的。
        4.一个广泛的标准库：Python的最大的优势之一是丰富的库，跨平台的，在UNIX，Windows和Macintosh兼容很好。
        5.互动模式：互动模式的支持，您可以从终端输入执行代码并获得结果的语言，互动的测试和调试代码片断。
        6.可移植：基于其开放源代码的特性，Python已经被移植（也就是使其工作）到许多平台。
        7.可扩展：如果你需要一段运行很快的关键代码，或者是想要编写一些不愿开放的算法，你可以使用C或C++完成那部分程序，
        然后从你的Python程序中调用。
        8.数据库：Python提供所有主要的商业数据库的接口。
        9.GUI编程：Python支持GUI可以创建和移植到许多系统调用。
        10.可嵌入: 你可以将Python嵌入到C/C++程序，让你的程序的用户获得"脚本化"的能力。
        
        缺点：
        1.运行慢
        运行速度和C程序比要慢很多，因为Python是解释型语言，代码在执行时会一行一行地翻译成CPU能理解的机器码，这个翻译过程非常耗时，所以很慢。
        2.代码安全性弱
        代码不能加密。如果要发布你的Python程序实际上就是发布源代码。
        3.学习曲线陡峭
        由于开源因素，造成不同的开发目的形成不同的应用框架，而框架对应不同的Python版本，使得为深入应用Python，需要搭建不同的框架平台并安装多个Python版本。
        
应用领域：数据分析与处理、Web开发与应用、人工智能应用

从终端运行python程序：打开cmd，转到要运行的文件所在的盘。输入： d: 回车  ,打开要运行的文件所在的文件夹。输入：cd d:\zouzou\source.pysrc\python01 回车。运行程序。输入：python 01.py (文件名) 回车


单行注释 ：在代码中使用#时，它右边的任何数据都会被忽略
多行注释：三引号''' 
'''